{
  "architectures": [
    "LayoutLMv3ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "coordinate_size": 128,
  "dtype": "float32",
  "eos_token_id": 2,
  "has_relative_attention_bias": true,
  "has_spatial_attention_bias": true,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-INVOICE_NO",
    "2": "I-INVOICE_NO",
    "3": "B-INVOICE_DATE",
    "4": "I-INVOICE_DATE",
    "5": "B-SELLER_NAME",
    "6": "I-SELLER_NAME",
    "7": "B-SELLER_ADDRESS",
    "8": "I-SELLER_ADDRESS",
    "9": "B-SELLER_PHONE",
    "10": "I-SELLER_PHONE",
    "11": "B-SELLER_EMAIL",
    "12": "I-SELLER_EMAIL",
    "13": "B-SELLER_GST_NO",
    "14": "I-SELLER_GST_NO",
    "15": "B-SELLER_PAN_NO",
    "16": "I-SELLER_PAN_NO",
    "17": "B-SELLER_STATE",
    "18": "I-SELLER_STATE",
    "19": "B-BUYER_NAME",
    "20": "I-BUYER_NAME",
    "21": "B-BUYER_ADDRESS",
    "22": "I-BUYER_ADDRESS",
    "23": "B-BUYER_PHONE",
    "24": "I-BUYER_PHONE",
    "25": "B-BUYER_EMAIL",
    "26": "I-BUYER_EMAIL",
    "27": "B-BUYER_GST_NO",
    "28": "I-BUYER_GST_NO",
    "29": "B-BUYER_PAN_NO",
    "30": "I-BUYER_PAN_NO",
    "31": "B-BUYER_STATE",
    "32": "I-BUYER_STATE",
    "33": "B-ITEM_NAME",
    "34": "I-ITEM_NAME",
    "35": "B-ITEM_QTY",
    "36": "I-ITEM_QTY",
    "37": "B-ITEM_UNIT_RATE",
    "38": "I-ITEM_UNIT_RATE",
    "39": "B-TOTAL_AMOUNT",
    "40": "I-TOTAL_AMOUNT",
    "41": "B-BANK_NAME",
    "42": "I-BANK_NAME",
    "43": "B-ACCOUNT_NUMBER",
    "44": "I-ACCOUNT_NUMBER",
    "45": "B-IFSC_CODE",
    "46": "I-IFSC_CODE",
    "47": "B-CGST",
    "48": "I-CGST",
    "49": "B-SGST",
    "50": "I-SGST",
    "51": "B-IGST",
    "52": "I-IGST"
  },
  "initializer_range": 0.02,
  "input_size": 224,
  "intermediate_size": 3072,
  "label2id": {
    "B-ACCOUNT_NUMBER": 43,
    "B-BANK_NAME": 41,
    "B-BUYER_ADDRESS": 21,
    "B-BUYER_EMAIL": 25,
    "B-BUYER_GST_NO": 27,
    "B-BUYER_NAME": 19,
    "B-BUYER_PAN_NO": 29,
    "B-BUYER_PHONE": 23,
    "B-BUYER_STATE": 31,
    "B-CGST": 47,
    "B-IFSC_CODE": 45,
    "B-IGST": 51,
    "B-INVOICE_DATE": 3,
    "B-INVOICE_NO": 1,
    "B-ITEM_NAME": 33,
    "B-ITEM_QTY": 35,
    "B-ITEM_UNIT_RATE": 37,
    "B-SELLER_ADDRESS": 7,
    "B-SELLER_EMAIL": 11,
    "B-SELLER_GST_NO": 13,
    "B-SELLER_NAME": 5,
    "B-SELLER_PAN_NO": 15,
    "B-SELLER_PHONE": 9,
    "B-SELLER_STATE": 17,
    "B-SGST": 49,
    "B-TOTAL_AMOUNT": 39,
    "I-ACCOUNT_NUMBER": 44,
    "I-BANK_NAME": 42,
    "I-BUYER_ADDRESS": 22,
    "I-BUYER_EMAIL": 26,
    "I-BUYER_GST_NO": 28,
    "I-BUYER_NAME": 20,
    "I-BUYER_PAN_NO": 30,
    "I-BUYER_PHONE": 24,
    "I-BUYER_STATE": 32,
    "I-CGST": 48,
    "I-IFSC_CODE": 46,
    "I-IGST": 52,
    "I-INVOICE_DATE": 4,
    "I-INVOICE_NO": 2,
    "I-ITEM_NAME": 34,
    "I-ITEM_QTY": 36,
    "I-ITEM_UNIT_RATE": 38,
    "I-SELLER_ADDRESS": 8,
    "I-SELLER_EMAIL": 12,
    "I-SELLER_GST_NO": 14,
    "I-SELLER_NAME": 6,
    "I-SELLER_PAN_NO": 16,
    "I-SELLER_PHONE": 10,
    "I-SELLER_STATE": 18,
    "I-SGST": 50,
    "I-TOTAL_AMOUNT": 40,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 514,
  "max_rel_2d_pos": 256,
  "max_rel_pos": 128,
  "model_type": "layoutlmv3",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "patch_size": 16,
  "rel_2d_pos_bins": 64,
  "rel_pos_bins": 32,
  "second_input_size": 112,
  "shape_size": 128,
  "text_embed": true,
  "transformers_version": "4.57.3",
  "type_vocab_size": 1,
  "visual_embed": true,
  "vocab_size": 50265
}
